faza5/mixology/app/Models/Model.php

    public function search( $arrayOfFilters,$type,$name){

        if($arrayOfFilters!=[]){
                $arrayOfFilters= explode(",", $arrayOfFilters);
                $count= count($arrayOfFilters); //countOfFilters
                $b=$this->db->table('cocktail')
                   ->join('contains','cocktail.IdCocktail=contains.IdCocktail')
                   ->join('ingredient','contains.IdIngredient=ingredient.IdIngredient');
                   $b->whereIn('ingredient.Name',$arrayOfFilters)
                   ->groupBy('cocktail.IdCocktail')
                   ->having('COUNT(cocktail.IdCocktail)', $count);
        }
        else{
                    $b=$this->db->table('cocktail')
                   ->join('contains','cocktail.IdCocktail=contains.IdCocktail')
                   ->join('ingredient','contains.IdIngredient=ingredient.IdIngredient')
                   ->groupBy('cocktail.IdCocktail');
        }

        if($type=="Alcoholic")$b->where ('Alcoholic',1);
        if($type=="Non alcoholic")$b->where ('Alcoholic',0);
        if($name!="")$b->like('CocktailName',$name);

        $b->where('Approved',1);//only approved cocktails

        return $b->get()->getResult();
---
SELECT *
FROM `cocktail`
JOIN `contains` ON `cocktail`.`IdCocktail`=`contains`.`IdCocktail`
JOIN `ingredient` ON `contains`.`IdIngredient`=`ingredient`.`IdIngredient`
WHERE `ingredient`.`Name` IN ('Vodka','Coca cola')
AND `Alcoholic` = 1
AND `Approved` = 1
GROUP BY `cocktail`.`IdCocktail`
HAVING COUNT(cocktail.IdCocktail) = 2

    public function getTopRatedCocktails() {
          return $this->db->table('cocktail')
                  ->orderBy('AvgGrade',"DESC")
                  ->where('Approved',1)
                  ->limit(10)->get()->getResult();
---
SELECT *
FROM `cocktail`
WHERE `Approved` = 1
ORDER BY `AvgGrade` DESC
 LIMIT 10